In [66]:
import pandas as pd
df = pd.read_csv('id_5000.csv',low_memory=False)
df.head()

   id        lat         lon
0   1  32.763766 -117.049148
1   2  32.746492 -117.052569
2   3  32.813676 -117.045670
3   4  32.822592 -117.050477
4   5  32.742601 -117.051568

In [67]:
df.tail()

        id        lat         lon
4885  4886  32.759160 -117.052123
4886  4887  32.740741 -117.048598
4887  4888  32.850549 -117.045421
4888  4889  32.866040 -117.053226
4889  4890  32.832269 -117.049832

In [68]:
#str转为float
df[['lat','lon']] = df[['lat','lon']].astype("float")
print(df.head())
print("--------"*10)
print(df.dtypes)

   id        lat         lon
0   1  32.763766 -117.049148
1   2  32.746492 -117.052569
2   3  32.813676 -117.045670
3   4  32.822592 -117.050477
4   5  32.742601 -117.051568
--------------------------------------------------------------------------------
id       int64
lat    float64
lon    float64
dtype: object

In [69]:
list_id = df['id'].tolist()
list_home_a = df['lat'].tolist()
list_home_b = df['lon'].tolist()

In [71]:
#计算距离
import math
from pandas.core.frame import DataFrame
dis_list_id_a = []
dis_list_id_b = []
dis_list_a_b = []
for i in range(0,len(list_id)):
    for j in range(0,len(list_id)):
        A = (float(list_home_a[i]) - float(list_home_a[j]))**2
        B = (float(list_home_b[i]) - float(list_home_b[j]))**2
        C = (A + B)**0.5*100
        
        dis_list_id_a.append(list_id[i])
        dis_list_id_b.append(list_id[j])
        dis_list_a_b.append(C)
        
        
        #print(list_id[i], list_id[j], C)
#print(dis_list_id_a,dis_list_id_b,dis_list_a_b)
dis_data={"id_a" : dis_list_id_a,
   "id_b" : dis_list_id_b,
   "dis_a_b" : dis_list_a_b } #将列表a，b转换成字典
data1=DataFrame(dis_data) #将字典转换成为数据框
print(data1.head())

   id_a  id_b   dis_a_b
0     1     1  0.000000
1     1     2  1.760950
2     1     3  5.003104
3     1     4  5.884101
4     1     5  2.130290

In [55]:
print(data1.tail())

        id_a  id_b   dis_a_b
122495   350   346  0.759736
122496   350   347  0.698486
122497   350   348  0.215875
122498   350   349  0.295027
122499   350   350  0.000000

In [56]:
data1[['id_a','id_b','dis_a_b']].to_csv('./id_2_corenode_dis.csv',index = None,header = True,sep = ',' , encoding='utf-8')
print(1)

1

In [72]:
#对于pandas中的Dataframe,如果需要按照列A进行分组，将同一组的列B求和,可以通过下述操作完成
data2 = data1.groupby(by=['id_a'])['dis_a_b'].sum()
data2.head()

id_a
1    33539.711840
2    37778.278627
3    31546.147845
4    32215.597125
5    38969.189461
Name: dis_a_b, dtype: float64

In [73]:
#生成的数据类型是Series,如果进一步需要将其转换为dataframe,可以调用Series中的to_frame()方法.
data2 = data2.to_frame()
#index column_A 
#column_B ->column_B values

In [74]:
#可以取出上述dataframe中的index,生成新的一列，并删除原dataframe中的index
data2['id_a'] =data2.index
data2 =data2.reset_index(drop= True)

In [75]:
data2.tail()

           dis_a_b  id_a
4885  34505.826049  4886
4886  39565.992875  4887
4887  36707.481041  4888
4888  40199.862658  4889
4889  33410.697531  4890

In [76]:
data2.min()

dis_a_b    30793.548685
id_a           1.000000
dtype: float64

In [77]:
#data[data2['dis_a_b']=data2['dis_a_b'].min()] code_1_id:4022   code_2_id: 211
#
d1 = data2[['id_a', 'dis_a_b']][data2['dis_a_b'] == data2['dis_a_b'].min()]
print(d1)

      id_a       dis_a_b
4021  4022  30793.548685

In [63]:
data2.to_csv('./id_2_a_b_coreno_id.csv',index = True,header = True,sep = ',' , encoding='utf-8')
print(1)

1

In [32]:
#first corenode id：220699	4022	lat：32.796537	lon：-117.049412	corenode       2KM：3202个点
#second corenode      id:182448	    211	32.719358	      -117.089168 离第一个点8KM   2KM：4798个点   id 10000 ：3191个点

In [31]:
data1.head()

   id_a  id_b   dis_a_b
0     1     1  0.000000
1     1     2  1.760950
2     1     3  5.003104
3     1     4  5.884101
4     1     5  2.130290